app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello test"], ["created_at", Sun, 24 Nov 2013 07:15:51 UTC +00:00], ["title", "test_one"], ["updated_at", Sun, 24 Nov 2013 07:15:51 UTC +00:00]]